In [2]:
import pandas as pd
import numpy as np

# Pandas Series

In [3]:
labels=['a','b','c','d']
myList = [1,2,3,4]
myDict={1:'a',2:'b',3:'c'}

In [4]:
pd.Series(data = myList)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
ser=pd.Series(data=myList,index=labels)
ser

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
ser1=pd.Series(data = myDict)
ser1

1    a
2    b
3    c
dtype: object

In [7]:
ser[3]

4

In [8]:
ser['d']

4

# DataFrame

In [9]:
pd.DataFrame(data= np.random.randn(5,4))

          0         1         2         3
0  0.995262 -0.472791 -0.843274 -0.348812
1  0.861850 -0.597529  1.150329 -0.496050
2  0.995249  1.623811  0.104686 -1.369747
3  0.112090  0.710595  0.989084  0.703611
4 -1.297349  0.284731 -0.285193  0.480505

In [10]:
pd.DataFrame(data= np.random.randn(5,4),index=['a','b','c','d','e'])

          0         1         2         3
a  2.408777  0.388162  1.074812 -2.224705
b -1.595946 -0.691315 -0.159379 -1.572338
c  0.345408  1.692400  0.552985 -2.195472
d  0.357044  0.700647  0.259424  1.032696
e -0.654917 -1.307318 -0.746570 -0.728095

In [11]:
df=pd.DataFrame(data= np.random.randn(5,4),index=['a','b','c','d','e'],columns=['w','r','z','x'])
df

          w         r         z         x
a -0.862854  0.328403  0.971223  0.087030
b  0.147087  0.258244 -1.309673 -2.401954
c -0.518481  0.034498 -2.457936 -1.008839
d  1.198610  0.024765  0.617089  0.123898
e  0.988218 -0.731179  1.304055 -1.406632

In [12]:
df['x']

a    0.087030
b   -2.401954
c   -1.008839
d    0.123898
e   -1.406632
Name: x, dtype: float64

In [13]:
df['w']

a   -0.862854
b    0.147087
c   -0.518481
d    1.198610
e    0.988218
Name: w, dtype: float64

In [14]:
df[['w','z']]

          w         z
a -0.862854  0.971223
b  0.147087 -1.309673
c -0.518481 -2.457936
d  1.198610  0.617089
e  0.988218  1.304055

In [15]:
df['new column']=df['w'] + df['z']

In [16]:
df

          w         r         z         x  new column
a -0.862854  0.328403  0.971223  0.087030    0.108369
b  0.147087  0.258244 -1.309673 -2.401954   -1.162585
c -0.518481  0.034498 -2.457936 -1.008839   -2.976417
d  1.198610  0.024765  0.617089  0.123898    1.815699
e  0.988218 -0.731179  1.304055 -1.406632    2.292272

In [17]:
df['new column']=[1,2,3,4,5]

In [18]:
df

          w         r         z         x  new column
a -0.862854  0.328403  0.971223  0.087030           1
b  0.147087  0.258244 -1.309673 -2.401954           2
c -0.518481  0.034498 -2.457936 -1.008839           3
d  1.198610  0.024765  0.617089  0.123898           4
e  0.988218 -0.731179  1.304055 -1.406632           5

In [19]:
df.shape

(5, 5)

In [20]:
df.drop('new column',axis=1) # axis 1 checks columns,axis=0 checks rows

          w         r         z         x
a -0.862854  0.328403  0.971223  0.087030
b  0.147087  0.258244 -1.309673 -2.401954
c -0.518481  0.034498 -2.457936 -1.008839
d  1.198610  0.024765  0.617089  0.123898
e  0.988218 -0.731179  1.304055 -1.406632

In [21]:
df # adding data  takes Inplace true as default

          w         r         z         x  new column
a -0.862854  0.328403  0.971223  0.087030           1
b  0.147087  0.258244 -1.309673 -2.401954           2
c -0.518481  0.034498 -2.457936 -1.008839           3
d  1.198610  0.024765  0.617089  0.123898           4
e  0.988218 -0.731179  1.304055 -1.406632           5

In [22]:
df.drop('new column',axis=1,inplace=True)

In [23]:
df

          w         r         z         x
a -0.862854  0.328403  0.971223  0.087030
b  0.147087  0.258244 -1.309673 -2.401954
c -0.518481  0.034498 -2.457936 -1.008839
d  1.198610  0.024765  0.617089  0.123898
e  0.988218 -0.731179  1.304055 -1.406632

In [24]:
df.loc['a'] # gives  all the value of given location

w   -0.862854
r    0.328403
z    0.971223
x    0.087030
Name: a, dtype: float64

In [25]:
df.iloc[0] # Gives all the value of given index i represents index

w   -0.862854
r    0.328403
z    0.971223
x    0.087030
Name: a, dtype: float64

In [26]:
df.loc['d']

w    1.198610
r    0.024765
z    0.617089
x    0.123898
Name: d, dtype: float64

In [27]:
df.loc[['a','b'],['w','z']]

          w         z
a -0.862854  0.971223
b  0.147087 -1.309673

In [28]:
df['w']>0

a    False
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [29]:
df[df['w']>0] # Print those rows Which are true

          w         r         z         x
b  0.147087  0.258244 -1.309673 -2.401954
d  1.198610  0.024765  0.617089  0.123898
e  0.988218 -0.731179  1.304055 -1.406632

In [30]:
df[df['w']>0]['x'] # Print The value of x only  wrt condition

b   -2.401954
d    0.123898
e   -1.406632
Name: x, dtype: float64

In [31]:
df['new']=['A','B','C','D','E']
df

          w         r         z         x new
a -0.862854  0.328403  0.971223  0.087030   A
b  0.147087  0.258244 -1.309673 -2.401954   B
c -0.518481  0.034498 -2.457936 -1.008839   C
d  1.198610  0.024765  0.617089  0.123898   D
e  0.988218 -0.731179  1.304055 -1.406632   E

In [32]:
df.set_index('new')   # It Doesn't affect the true df i.e shown in nxt cmmnd

            w         r         z         x
new
A   -0.862854  0.328403  0.971223  0.087030
B    0.147087  0.258244 -1.309673 -2.401954
C   -0.518481  0.034498 -2.457936 -1.008839
D    1.198610  0.024765  0.617089  0.123898
E    0.988218 -0.731179  1.304055 -1.406632

In [33]:
df

          w         r         z         x new
a -0.862854  0.328403  0.971223  0.087030   A
b  0.147087  0.258244 -1.309673 -2.401954   B
c -0.518481  0.034498 -2.457936 -1.008839   C
d  1.198610  0.024765  0.617089  0.123898   D
e  0.988218 -0.731179  1.304055 -1.406632   E

In [34]:
df.set_index('new',inplace=True) # Now It affect the original copy bcoz inplace is true

In [35]:
df

            w         r         z         x
new
A   -0.862854  0.328403  0.971223  0.087030
B    0.147087  0.258244 -1.309673 -2.401954
C   -0.518481  0.034498 -2.457936 -1.008839
D    1.198610  0.024765  0.617089  0.123898
E    0.988218 -0.731179  1.304055 -1.406632

# Groupby

In [36]:
data = {'Employee_company':['Google','Google','Facebook','Facebook','Microsoft','Microsoft'],'Employee Id':['P1','P2','P3','P4','P5','P6'],'salary':[4500,6000,2300,5600,4660,8765]}

In [37]:
df=pd.DataFrame(data)
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

In [38]:
df.sum()

Employee_company    GoogleGoogleFacebookFacebookMicrosoftMicrosoft
Employee Id                                           P1P2P3P4P5P6
salary                                                       31825
dtype: object

In [39]:
df.groupby('Employee_company').max()

                 Employee Id  salary
Employee_company
Facebook                  P4    5600
Google                    P2    6000
Microsoft                 P6    8765

In [40]:
df.groupby('Employee_company').sum()

                  salary
Employee_company
Facebook            7900
Google             10500
Microsoft          13425

In [41]:
df.groupby('Employee_company').min()

                 Employee Id  salary
Employee_company
Facebook                  P3    2300
Google                    P1    4500
Microsoft                 P5    4660

In [42]:
df.describe()

            salary
count     6.000000
mean   5304.166667
std    2127.708666
min    2300.000000
25%    4540.000000
50%    5130.000000
75%    5900.000000
max    8765.000000

In [43]:
df.groupby('Employee_company').describe()

                 salary                                                \
                  count    mean          std     min      25%     50%
Employee_company
Facebook            2.0  3950.0  2333.452378  2300.0  3125.00  3950.0
Google              2.0  5250.0  1060.660172  4500.0  4875.00  5250.0
Microsoft           2.0  6712.5  2902.673337  4660.0  5686.25  6712.5


                      75%     max
Employee_company
Facebook          4775.00  5600.0
Google            5625.00  6000.0
Microsoft         7738.75  8765.0

# concatenation

In [44]:
pd.concat([df,pd.DataFrame({'Employee_company':'TCS','Employee Id':'P7','salary':1100},index=[6]) ])# Row Concat

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765
6              TCS          P7    1100

In [45]:
df=pd.concat([df,pd.DataFrame([1,2,3,4,5,6],columns=['number'])],axis=1)
df# Column Wise Concat

  Employee_company Employee Id  salary  number
0           Google          P1    4500       1
1           Google          P2    6000       2
2         Facebook          P3    2300       3
3         Facebook          P4    5600       4
4        Microsoft          P5    4660       5
5        Microsoft          P6    8765       6

In [46]:
df.drop('number',axis=1,inplace=True)

In [47]:
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

# Miscellaneous

In [48]:
df['Employee_company'].unique()

array(['Google', 'Facebook', 'Microsoft'], dtype=object)

In [49]:
df['Employee_company'].nunique()

3

In [50]:
df.groupby('Employee_company').count()

                  Employee Id  salary
Employee_company
Facebook                    2       2
Google                      2       2
Microsoft                   2       2

In [51]:
df['Employee_company'].count()

6

In [52]:
df['Employee_company'].value_counts()

Google       2
Facebook     2
Microsoft    2
Name: Employee_company, dtype: int64

In [45]:
def time2(value):
    return value*2

In [169]:
df['salary'].apply(time2)

0     9000
1    12000
2     4600
3    11200
4     9320
5    17530
Name: salary, dtype: int64

In [170]:
df['salary'].apply(lambda x:x*2)

0     9000
1    12000
2     4600
3    11200
4     9320
5    17530
Name: salary, dtype: int64

In [172]:
df['Employee_company'].apply(len)

0    6
1    6
2    8
3    8
4    9
5    9
Name: Employee_company, dtype: int64

In [173]:
df.apply(len)

Employee_company    6
Employee Id         6
salary              6
dtype: int64

In [174]:
df.sort_values('salary',ascending=False)

  Employee_company Employee Id  salary
5        Microsoft          P6    8765
1           Google          P2    6000
3         Facebook          P4    5600
4        Microsoft          P5    4660
0           Google          P1    4500
2         Facebook          P3    2300

In [175]:
df.drop(5)

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660

In [176]:
df.columns

Index(['Employee_company', 'Employee Id', 'salary'], dtype='object')

In [178]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [180]:
df

  Employee_company Employee Id  salary
0           Google          P1    4500
1           Google          P2    6000
2         Facebook          P3    2300
3         Facebook          P4    5600
4        Microsoft          P5    4660
5        Microsoft          P6    8765

# Read CSV

In [3]:
df1=pd.read_csv('data.csv')

In [4]:
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df1.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB